% Обчислення нулів та полюсів інтеграторів
disp('Нулі та полюси інтегратора методом прямокутників') 
x1 = roots(b);
disp(x);
disp('Нулі та полюси  інтегратора методом трапецій') 
x2 = roots(b1);
disp(x2);
disp('Нулі та полюси  інтегратора методом парабол (Сімпсона)') 
x3 = roots(b2); 
disp(x3);
% Карта нулів та полюсів фільтру
figure(17);
k = zplane(x1);
title('Карта нулів та полюсів інтегратора методом прямокутників')
% Карта нулів та полюсів фільтру
figure(18);
k1 = zplane(x2);
title('Карта нулів та полюсів інтегратора методом трапецій')
% Карта нулів та полюсів фільтру
figure(19);
k2 = zplane(x3);
title('Карта нулів та полюсів інтегратора методом парабол (Сімпсона)')

disp('Передавальна функція інтегратора методом прямокутників') 
H = filt(b,a)
disp('Передавальна функція інтегратора методом трапецій') 
H1 = filt(b1,a1)
disp('Передавальна функція інтегратора методом парабол (Сімпсона)') 
H2 = filt(b2,a2)
