% АЧХ і ФЧХ цифрових інтеграторів
% Інтегрування методом прямокутників
fs = 300;   % частота дискретизації
T = 1/fs;
% Інтегрування методом прямокутників 
b =T*1; % чисельник ПФ
a = [1 -1]; % знаменник ПФ
% Інтегрування методом трапецій.
b1 = [1 1]*T/2;
a1 = [1 -1];
% Інтегрування методом парабол (Сімпсона)
b2 = [1 4 1]*T/3;
a2 = [1 0 -1];
n = 512;    % кількість точок, що розраховуються
[h,f] = freqz(b,a,n);
mag = abs(h);
phase = angle(h)*180/pi;
[h1,f1] = freqz(b1,a1,n);
mag1 = abs(h1);
phase1 = angle(h1)*180/pi;
[h2,f2] = freqz(b2,a2,n);
mag2 = abs(h2);
phase2 = angle(h2)*180/pi;
%позначення осей графіків
figure(15);
subplot(1,3,1), plot(f/(2*pi)*fs,mag), grid on;
title('АЧХ цифрових інтеграторів методом прямокутників');
xlabel('Частота'), ylabel('Амплітуда');

subplot(1,3,2), plot(f1/(2*pi)*fs,mag1), grid on;
title('АЧХ цифрових інтеграторів методом трапецій'); 
xlabel('Частота'), ylabel('Амплітуда');

subplot(1,3,3), plot(f2/(2*pi)*fs,mag2), grid on;
title('АЧХ цифрових інтеграторів методом Сімпсона'); 
xlabel('Частота'), ylabel('Амплітуда');

figure(16);
subplot(1,3,1), plot(f/(2*pi)*fs,unwrap(phase)), grid on;
title('ФЧХ цифрових інтеграторів методом прямокутників');
xlabel('Частота'), ylabel('Фаза');

subplot(1,3,2), plot(f1/(2*pi)*fs,unwrap(phase1)), grid on;
title('ФЧХ цифрових інтеграторів методом трапецій'); 
xlabel('Частота'), ylabel('Фаза');

subplot(1,3,3), plot(f2/(2*pi)*fs,unwrap(phase2)), grid on;
title('ФЧХ цифрових інтеграторів методом Сімпсона'); 
xlabel('Частота'), ylabel('Фаза');