fs = 200; 
T = 1/fs; 
D = 0.25;
n = 0:1000;
r = randn(size(n))*sqrt(D);    
s = 1.8*cos(20*pi*n*T);        
x = s + r;                     
figure(1);
plot(x);
title('Стохастичний сигнал');   %пише заголовок
xlabel('n'), ylabel('x(n)');
fprintf('Математичне сподівання сигналу = %4.3g\n', mean(s));   %вивод на консоль тексту + значення
fprintf('Дисперсія сигналу = %4.3g\n', var(s));
fprintf('Математичне сподівання шуму = %4.3g\n', mean(r));
fprintf('Дисперсія шуму = %4.3g\n', var(r));
fprintf('Математичне сподівання сигнал + шум = %4.3g\n', mean(x));
fprintf('Дисперсія сигнал + шум = %4.3g\n', var(x));