% Дослідження властивостей простого режекторного фільтру
br = [1 0.618 1];   % коефіцієнти різницевого рівняння 
ar = 1;
n =  512;	% кількість точок, що розраховуються
fs = 200;
figure();
[h,w] = freqz(br, ar, n, fs);
%введіть позначення осей графіків
mag = abs(h); 
phase = angle(h)*180/pi;
subplot(2,1,1), plot(w/(2*pi)*fs, mag), grid on;
title('АЧХ');
xlabel('Частота'), ylabel('Амплітуда');
subplot(2,1,2), plot(w/(2*pi)*fs, unwrap(phase)), grid on;
title('ФЧХ');
xlabel('Частота'), ylabel('Фаза');
% Обчислення нулів фільтру
disp('Нулі режекторного фільтру');
xr = roots(br)
% Карта нулів та полюсів фільтру
figure();
zp = zplane(xr);
% Побудова передавальної функції
disp('Передавальна функція');
H = filt (br, ar)